# GitHub Profile Fetcherの画面仕様

* GitHub Profile Fetcherを開く

## GitHub Profile Fetcherの画面を見ることができる
* ページタイトルに"GitHub Profile Fetcher"が表示されていること

## GitHub IDの入力フォームを見ることができる
* GitHub IDの入力フォームが表示されていること
* GitHub IDの入力フォームにプレースホルダーとして"GitHub ID を入力してください"が表示されていること

## プロフィール取得ボタンを見ることができる
* ボタン"Get user info"が表示されていること

## 入力したGitHub IDのユーザプロフィールを見ることができる
* GitHub ID"yuya03"を入力する
* ユーザプロフィール取得ボタンをクリックする
* プロフィールでタイトル"GitHub User Profile"が表示されている
* プロフィールでユーザ名"yuya03"が表示されている
* プロフィールでアバターアイコンが表示されている
* プロフィールでユーザホームURLが表示されている

## GitHub IDが入力されていない状態でプロフィールを取得するとエラーメッセージが表示される
* ユーザプロフィール取得ボタンをクリックする
* "プロフィールを取得したい GitHub ID を入力してください"というエラーメッセージが表示されていること
* プロフィールが表示されていない
